{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input-Token"}, "name": "Input-Token", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input-Segment"}, "name": "Input-Segment", "inbound_nodes": []}, {"class_name": "TokenEmbedding", "config": {"name": "Embedding-Token", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30522, "output_dim": 768, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "Embedding-Token", "inbound_nodes": [[["Input-Token", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "Embedding-Segment", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 768, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "Embedding-Segment", "inbound_nodes": [[["Input-Segment", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Embedding-Token-Segment", "trainable": true, "dtype": "float32"}, "name": "Embedding-Token-Segment", "inbound_nodes": [[["Embedding-Token", 0, 0, {}], ["Embedding-Segment", 0, 0, {}]]]}, {"class_name": "PositionEmbedding", "config": {"name": "Embedding-Position", "trainable": true, "dtype": "float32", "input_dim": 500, "output_dim": 768, "mode": "add", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "Embedding-Position", "inbound_nodes": [[["Embedding-Token-Segment", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Embedding-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Embedding-Dropout", "inbound_nodes": [[["Embedding-Position", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Embedding-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Embedding-Norm", "inbound_nodes": [[["Embedding-Dropout", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-1-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-1-MultiHeadSelfAttention", "inbound_nodes": [[["Embedding-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-1-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-1-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Embedding-Norm", 0, 0, {}], ["Encoder-1-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-1-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-1-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-1-FeedForward", "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-1-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-1-FeedForward-Dropout", "inbound_nodes": [[["Encoder-1-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-1-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-1-FeedForward-Add", "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-1-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-1-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-1-FeedForward-Norm", "inbound_nodes": [[["Encoder-1-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-2-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-2-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-1-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-2-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-2-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-1-FeedForward-Norm", 0, 0, {}], ["Encoder-2-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-2-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-2-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-2-FeedForward", "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-2-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-2-FeedForward-Dropout", "inbound_nodes": [[["Encoder-2-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-2-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-2-FeedForward-Add", "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-2-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-2-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-2-FeedForward-Norm", "inbound_nodes": [[["Encoder-2-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-3-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-3-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-2-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-3-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-3-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-3-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-3-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-3-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-2-FeedForward-Norm", 0, 0, {}], ["Encoder-3-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-3-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-3-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-3-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-3-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-3-FeedForward", "inbound_nodes": [[["Encoder-3-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-3-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-3-FeedForward-Dropout", "inbound_nodes": [[["Encoder-3-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-3-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-3-FeedForward-Add", "inbound_nodes": [[["Encoder-3-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-3-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-3-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-3-FeedForward-Norm", "inbound_nodes": [[["Encoder-3-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-4-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-4-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-3-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-4-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-4-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-4-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-4-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-4-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-3-FeedForward-Norm", 0, 0, {}], ["Encoder-4-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-4-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-4-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-4-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-4-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-4-FeedForward", "inbound_nodes": [[["Encoder-4-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-4-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-4-FeedForward-Dropout", "inbound_nodes": [[["Encoder-4-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-4-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-4-FeedForward-Add", "inbound_nodes": [[["Encoder-4-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-4-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-4-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-4-FeedForward-Norm", "inbound_nodes": [[["Encoder-4-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-5-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-5-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-4-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-5-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-5-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-5-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-5-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-5-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-4-FeedForward-Norm", 0, 0, {}], ["Encoder-5-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-5-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-5-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-5-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-5-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-5-FeedForward", "inbound_nodes": [[["Encoder-5-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-5-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-5-FeedForward-Dropout", "inbound_nodes": [[["Encoder-5-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-5-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-5-FeedForward-Add", "inbound_nodes": [[["Encoder-5-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-5-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-5-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-5-FeedForward-Norm", "inbound_nodes": [[["Encoder-5-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-6-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-6-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-5-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-6-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-6-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-6-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-6-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-6-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-5-FeedForward-Norm", 0, 0, {}], ["Encoder-6-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-6-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-6-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-6-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-6-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-6-FeedForward", "inbound_nodes": [[["Encoder-6-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-6-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-6-FeedForward-Dropout", "inbound_nodes": [[["Encoder-6-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-6-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-6-FeedForward-Add", "inbound_nodes": [[["Encoder-6-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-6-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-6-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-6-FeedForward-Norm", "inbound_nodes": [[["Encoder-6-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-7-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-7-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-6-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-7-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-7-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-7-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-7-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-7-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-6-FeedForward-Norm", 0, 0, {}], ["Encoder-7-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-7-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-7-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-7-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-7-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-7-FeedForward", "inbound_nodes": [[["Encoder-7-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-7-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-7-FeedForward-Dropout", "inbound_nodes": [[["Encoder-7-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-7-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-7-FeedForward-Add", "inbound_nodes": [[["Encoder-7-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-7-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-7-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-7-FeedForward-Norm", "inbound_nodes": [[["Encoder-7-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-8-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-8-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-7-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-8-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-8-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-8-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-8-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-8-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-7-FeedForward-Norm", 0, 0, {}], ["Encoder-8-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-8-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-8-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-8-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-8-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-8-FeedForward", "inbound_nodes": [[["Encoder-8-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-8-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-8-FeedForward-Dropout", "inbound_nodes": [[["Encoder-8-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-8-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-8-FeedForward-Add", "inbound_nodes": [[["Encoder-8-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-8-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-8-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-8-FeedForward-Norm", "inbound_nodes": [[["Encoder-8-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-9-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-9-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-8-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-9-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-9-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-9-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-9-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-9-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-8-FeedForward-Norm", 0, 0, {}], ["Encoder-9-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-9-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-9-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-9-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-9-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-9-FeedForward", "inbound_nodes": [[["Encoder-9-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-9-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-9-FeedForward-Dropout", "inbound_nodes": [[["Encoder-9-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-9-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-9-FeedForward-Add", "inbound_nodes": [[["Encoder-9-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-9-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-9-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-9-FeedForward-Norm", "inbound_nodes": [[["Encoder-9-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-10-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-10-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-9-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-10-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-10-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-10-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-10-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-10-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-9-FeedForward-Norm", 0, 0, {}], ["Encoder-10-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-10-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-10-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-10-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-10-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-10-FeedForward", "inbound_nodes": [[["Encoder-10-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-10-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-10-FeedForward-Dropout", "inbound_nodes": [[["Encoder-10-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-10-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-10-FeedForward-Add", "inbound_nodes": [[["Encoder-10-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-10-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-10-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-10-FeedForward-Norm", "inbound_nodes": [[["Encoder-10-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-11-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-11-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-10-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-11-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-11-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-11-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-11-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-11-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-10-FeedForward-Norm", 0, 0, {}], ["Encoder-11-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-11-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-11-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-11-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-11-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-11-FeedForward", "inbound_nodes": [[["Encoder-11-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-11-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-11-FeedForward-Dropout", "inbound_nodes": [[["Encoder-11-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-11-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-11-FeedForward-Add", "inbound_nodes": [[["Encoder-11-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-11-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-11-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-11-FeedForward-Norm", "inbound_nodes": [[["Encoder-11-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "Encoder-12-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "name": "Encoder-12-MultiHeadSelfAttention", "inbound_nodes": [[["Encoder-11-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-12-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-12-MultiHeadSelfAttention-Dropout", "inbound_nodes": [[["Encoder-12-MultiHeadSelfAttention", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-12-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-12-MultiHeadSelfAttention-Add", "inbound_nodes": [[["Encoder-11-FeedForward-Norm", 0, 0, {}], ["Encoder-12-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-12-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-12-MultiHeadSelfAttention-Norm", "inbound_nodes": [[["Encoder-12-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"class_name": "FeedForward", "config": {"name": "Encoder-12-FeedForward", "trainable": true, "dtype": "float32", "units": 3072, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "name": "Encoder-12-FeedForward", "inbound_nodes": [[["Encoder-12-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Encoder-12-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Encoder-12-FeedForward-Dropout", "inbound_nodes": [[["Encoder-12-FeedForward", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Encoder-12-FeedForward-Add", "trainable": true, "dtype": "float32"}, "name": "Encoder-12-FeedForward-Add", "inbound_nodes": [[["Encoder-12-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-12-FeedForward-Dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Encoder-12-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "name": "Encoder-12-FeedForward-Norm", "inbound_nodes": [[["Encoder-12-FeedForward-Add", 0, 0, {}]]]}, {"class_name": "Extract", "config": {"name": "Extract", "trainable": true, "dtype": "float32", "index": 0}, "name": "Extract", "inbound_nodes": [[["Encoder-12-FeedForward-Norm", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "NSP-Dense", "trainable": true, "dtype": "float32", "units": 768, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "NSP-Dense", "inbound_nodes": [[["Extract", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["NSP-Dense", 0, 0, {}]]]}], "input_layers": [["Input-Token", 0, 0], ["Input-Segment", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}